[
    {
        "id": 6,
        "date": "07-08-2025",
        "postTitle": "Suspension 101 part 2: Rear coilovers, camber and toe arms install",
        "contentOne": "",
        "contentOneExample": "",
        "contentOnePics": [],
        "contentTwo": "",
        "contentTwoPics": [],
        "contentThree": "",
        "contentThreePics": [],
        "contentFour": "",
        "contentFourPics": [],
        "contentFive": "",
        "contentFivePics": [],
        "contentSource": "",
        "contentSourceText": "",
        "headerPic": "",
        "bottomPics": [],
        "midPicsOne": [],
        "midPicsTwo": [],
        "topPics": [],
        "tableData": {},
        "tableSource": "",
        "tableSourceText": ""
    },
    {
        "id": 5,
        "date": "07-06-2025",
        "postTitle": "Suspension 101 part 1: Front coilovers and FUCA install",
        "contentOne": "I bought Fortune Auto 500 coilovers, SPL front upper control arms, SPL rear camber arms, SPL rear toe arms, a Z1 diff brace, and Z1 2 piece slotted rotors last black friday. These parts have sat in my office until today. Enough is enough I cant stare at them anymore, so let's get to it. It's been a minute since I worked on cars (the 350z days) so I inevitably made some mistakes on the first side I started on. Although I have an impact, it is very old and not that powerful, it struggled to break bolts loose and instead I used a breaker bar for everything. So removing suspension components from the front isnt hard, but there are more things that need to come off compared to the rear. First, I started by loosening the three 12mm nuts at the top of the shock, these are found in the engine bay. The strut tower bar does NOT need to be removed to find these bolts, unlike on the 350z. I then removed the 14mm bolt that holds the front upper control arm's ball joint to the steering knuckle, whch gave me a lot of room to be able to eventually remove the stock shock. Once that bolt is removed the steering knuckle flew fowards almost smaking me in the face. I had to keep the knuckle pushed back by hanging a caliper hanger from the upper control arm to the spot on the knuckle where the ball joint goes into. This was because if the knuckle flings forward it pulls the break line and that is no bueno.",
        "contentOneExample": "",
        "contentOnePics": ["stock_suspension", "shock_nuts"],
        "contentTwo": "After the knuckle was out of the way, I used a breaker bar on the 19mm shock mount bolt. This bolt on the Z is actually part of the sway bar endlink so the endlink needs to be complely removed from the car in order to be able to remove the shock mount bolt. I had to use a hammer and a breaker bar to remove the endlink bolt that connects to the swar bar. This was way easier than fighting the bolt with only the breaker bar. One trick I like to do is to put a jack under the steering knuckle and slightly jack it up to relieve any possible tension that may exist on that shock bolt when the suspension components are hanging. Ok, so now the speed sensors on the right of the shock need to be pulled out of the brackets in order to make additional room for the shock coming out / to not damage them. The shock came out pretty easily at that point, but another trick that can be used here is to pull down on the knuckle, which will pull down the shock and give even more room to pull it out. Once the shock is out it's time to remove the upper control arm by removing the two 15mm bolts that are holding it in, and that's all the components removed yay!",
        "contentTwoPics": ["shock_bolt", "shock_endlink", "hammer_endlink"],
        "contentThree": "The Fortune Auto coilovers need to have about 1/8th inch of preload added to the spring so I did that by first measuring the length of the spring, then loosening the top spindle with a 5mm hex, and turning the spring perch until the spring compressed 1/8th inches. I took the stock upper control arm and put it side by side to the new SPL one. You can tell which control arm goes on what side by looking at how the stock upper control arm ball joint is tilted. So, for the drivers side the ball joint should look kinda like this \\ if you look at it from the front. The SPL instructions are pretty straight forward, but they basically tell you to set the length of the arms as close as you can get them to the stock ones before installation, which involved using a 3/8th hex socket to loosen itty bitty hex bolts on the arms and then eventually torqueing them down to 150 in/lbs which is 12.5 ft/lbs. One of these hex bolts snapped while torqueing it down because I read the torque spec in ft/lbs and torqued it down to 150 ft/lbs!!",
        "contentThreePics": ["fuca", "broken_hex_bolt"],
        "contentFour": "Alright the fun part is putting everything back together. So, I started by putting the upper control arm back and torqueing those bolts down to 42 ft/lbs. Next I put the coilover into the shock mount and slid the endlink / shock mount bolt through. The other end of the endlink that attaches to the sway bar cant be bolted back on unless you unbolt the other side of the car too so the sway bar can freely move. I made the mistake of bolting the drivers side endlink to the sway bar, which added tension on the passengers side endlink swaybar bolt, making it impossible to remove. So, I had to slightly jack up the drivers sway bar until I could slide the endlink out and then the sway bar was free to move. I also used a 17mm wrench to hold the nut on the endlink side from spinning when tightening the endlink bolt to the sway bar. At this point, both the endlinks were bolted onto the sway bar at the same time with no tension on either side. The shock mount bolt was torqued down to 120 ft/lbs and the endlink-sway bar bolt was torqued to 62 ft/lbs.",
        "contentFourPics": ["new_suspension", "shock_endlink_new"],
        "contentFive": "All that is left is to bolt down the top of the coilovers and pop the ball joint of the upper control arm into the steering knuckle. Totally not frustrating :/. To get the coilover mounted at the top I had to jack up the knuckle very carefully until the three bolts on the top of the coilover went through the holes. I tried by myself but the knuckle kept flying towards me and the coilover kept moving so it was hard to line it up at top. This was a bit tricky by myself so I got my wife to control the jack while I held the coilover in place so it would stop flopping around. I added tape to the inside of the socket and inserted the nuts for these three bolts so that the 12mm nut wouldnt accidentally fall off and into the engine bay as I attempted to put them back onto the coilover top hat. These three bolts were torqued to 24 ft/lbs. Getting the ball joint into the knuckle was a huge pain in the ass. It did not want to go in at all. I had to go to Lowes and buy a c clamp and a pry bar. I used the pry bar initially to pry open the slot where the ball joint goes in, trying to make some room for it to slide in. This kinda worked but the c clamp was much easier to use and forced the ball joint in super easy. So the front is all done and all I have left is to wait for a new hext bolt to be delivered for the drivers side upper control arm ;_;, but overall a good learning / refresher day.",
        "contentFivePics": ["top_hat_trick", "top_hat"],
        "contentSource": "",
        "contentSourceText": "",
        "headerPic": "",
        "tableData": {},
        "tableSource": "",
        "tableSourceText": ""
    },
    {
        "id": 4,
        "date": "02-06-2025",
        "postTitle": "Chrome deleting katanas",
        "contentOne": "Dear diary, it's me again. One of the things that I really didn't like about the new Z was the chrome trime pieces that go from the top of the windows to the rear trunk. Nissan calls these katanas. I don't know why they thought these looked good, but after seeing what people on the Z forums where doing to them I started to watch way too many chrome delete DIY videos. You can either color match them to your car, or do a matte black wrap. I decided to go with the gloss black wrap since I thought it would look better with the black roof and black wheels and other black accents already on the car. I also decided to try and do it myself since paying a professional to do it would be between $350-$400 in my area. Most of the supplies were bought from Amazon for about $80 total and I already owned a heat gun from rolling my 350z's fenders.",
        "contentOneExample": "",
        "contentOnePics": ["stock_katana", "supplies"],
        "contentTwo": "I started by doing some research on how to remove the katanas from the car, which is not easy at all. Removing the rear ones requires you to buy a replacement part, since Nissan strongly suggests to replace one of the pieces that you have to remove to get them off. So I did the next best thing and left them on the car. I started by cleaning the area with isopropyl alcohol and then taped off the areas around the katanas. I then cut the wrap into strips that were about 3 inches longer than they needed to be just incase. I peeled off the backing and applied the wrap to the katana, using a squeegee to smooth out any air bubbles. I then used a heat gun to heat up the wrap and make it more pliable, allowing me to stretch it around the end corners. The corners turned out to be a lot more difficult than youtube led me to believe. The rear ones weren't that bad since you have more room to stretch the wrap around the corners and work them in flat in the space between the roof and the trunk lid. However, the front ones were a pain to get completely flat. Most of the time I spent wrapping was spent trying to get the corners flat. The wrap then got tucked in under the katanas using a squeegee, an exacto knife was used to trim off the extra wrap around the tucked in parts, and then used the heat gun again to seal the edges.",
        "contentTwoPics": ["taped_up_katana", "front_katana"],
        "contentThree": "I would say that it came out ok for my first time, but there are definitely some imperfections that I can see up close. From a few feet away it looks really good though. The corners for the front pieces dont look good and arent flat. I did mess up cutting the wrap in some spots because you have to cut the wrap slow enough to be able to cut in a straigh line. When I rushed or sped up, the knife moved around. I was also trying to get one of the rear pieces tucked in and it wouldnt tuck completely for some reason, which got me super frustrated and in my rage I blasted the wrap with too much heat from the heat gun, melting part of the rubber trim piece that is part of the quarter glass. :/ that's what I get. Nissan doesnt sell the rubber trim pieces so I have to buy a new quarter glass, which costs about $400 without taking into account the labor for the install. No thanks, I found one from a junk yard for $100. Overall I'd say it is a 6/10 - 7/10 job, but I'll probably bring it to a professional to get done next time because all the trouble IMO wasnt worth it..",
        "contentThreePics": ["fail", "quarter_glass"],
        "contentFour": "",
        "contentFourPics": [],
        "contentFive": "",
        "contentFivePics": [],
        "contentSource": "",
        "contentSourceText": "",
        "headerPic": "wrap_header",
        "tableData": {},
        "tableSource": "",
        "tableSourceText": ""
    },
    {
        "id": 3,
        "date": "07-18-2024",
        "postTitle": "Breaking news shocking news",
        "contentOne": "Did you hear the news? Breaking news? Shocking news? There's a new addition to the Spare Parts family: a new Z. I used to own a 2008 350z for 12 years and enjoyed every second with that car. Totally didn't expect to get one yet, but I don't know...I walked into the dealership to browse and the next thing I know I was signing the paperwork and picking the car up the next day. Anyways, the car came with a front lip from Nissan that I may install in the future, although it will probably get scraped up pretty badly once the car is on coilovers. Wheel gap makes me sick.",
        "contentOneExample": "",
        "contentOnePics": ["stylo", "stylo_two", "new_z"],
        "contentTwo": "I bought a Z1 oil catch can the day I signed the paperwork for the car and installed it over the weekend. Catch cans can help remedy a phenomena called blow-by, which is when pressure leaks past the piston rings and into the crankcase (basically the empty space in an engine) when the car is running. In turbo charged cars you have a lot more pressure being created = higher levels of blow-by = higher levels of oil / contaminants getting into the intake system. In theory these catch cans are supposed to collect oil vapor / contaminants before they reach the engine's intake manifold so there isn't a build up of carbon on the intake valves. The catch can collects the contaminants at the bottom and the clean air is passed back into the intake system.",
        "contentTwoPics": [],
        "contentThree": "Unfortunately I didn't take any pics during the install. I was too distracted making the install way harder for myself. I had the big brain idea to not follow the instructions when they said to take off the driver side intercooler for more room and instead installed everything with as little room as possible. As long as your hand can fit in a space it's all good right? :/ Removing the hoses and putting in the new ones was easy, it was putting the freaking hose clamps back on that was the issue. What a pain in the ass it was to put those clamps on. After adding lube to the hose / around the clamp and using needle nose pliers I was able to finish in about 5 minutes..I don't know why I always choose to do things the hard way.",
        "contentThreePics": ["catch_can", "catch_can_installed"],
        "contentFour": " Car forum nerds argue back and forth if catch cans are worth it, however IMO as a preventative measure for future repairs in 70k or 80k miles why wouldn't you get one? Below are some pics of when I recently serviced the catch can after about 750 miles. There is a little bit of oil caught at the bottom. I'll probably service it every 1.5k - 3k miles going forward.",
        "contentFourPics": ["catch_can_top", "caught_oil"],
        "contentFive": "",
        "contentFivePics": [],
        "contentSource": "",
        "contentSourceText": "",
        "headerPic": "",
        "tableData": {},
        "tableSource": "https://cdn.z1motorsports.com/upload/Install_Z1_Z_Catch_Can.pdf",
        "tableSourceText": "Z1 Oil Catch Can install instructions"
    },
    {
        "id": 2,
        "date": "07-01-2024",
        "postTitle": "Calculating wheel offsets in general & after changing lip / barrel size",
        "contentOne": "I like running lower offset wheels. Offset is the measurement of the distance between the wheels mounting surface and the centerline of the wheel. More negative = wheel sticks out more from the fender = more cool (to a degree). You could potentially run into break clearance issues depending on the offset of your wheels, which can be fixed by running some wheel spacers or by doing more reasearch on what offsets are 'ideal' to your needs. The first method uses a ruler and another straight edge to calculate the wheels offset. This video from Driftworks in the link below will explain how to do that, and it's exactly what I did.",
        "contentOneExample": "Although I already know the offset of my wheels, I wanted to try out the method myself. The wheel in the pictures below is a very dirty Work Equip 05 18 x 11 -4. The FIRST picture gives the measurement from the floor which is 302mm and taking half of that to find the centerline of the wheel gives 151mm. The SECOND picture is the measurement from the hub face, which is 155mm. So 151mm - 155mm = -4mm. The offset is -4mm. The THIRD picture is the measurement from the floor to the hub face, which is 155mm. So, 151mm - 155mm = -4mm. The offset is -4mm.",
        "contentOnePics": ["from_floor_measurement", "from_hub_face", "hub_face_to_floor"],
        "contentTwo": "The second method involves resizing your wheels by changing the lip and barrel sizes, if your wheels are multi piece wheels. This will cause positive and negative changes to the offset depending on whether the lip or barrel was resized and by how much. The table below is what I have used to calculate new offsets in the past. Here you can see the change in wheel offset for every inch or half inch change in lip and barrel size.",
        "contentTwoPics": [],
        "contentThree": "As an example, 18 x 11 -4  with a 4 inch lip and a 7 inch barrel  ===>  18 x 9.5 2.35 with a 3 inch lip and a 6.5 inch barrel. The lip was shortened by 1 inch, bringing the offset from -4 to 8.7 ( -4 + 12.7 ), and the barrel was shortened by 0.5 inches, bringing the final offset to 2.35 ( 8.7 - 6.35 ).",
        "contentThreePics": [],
        "contentFour": "Another example, 18 x 11 -4  with a 4 inch lip and a 7 inch barrel  ===>  18 x 9.5 12.05 with a 2.5 inch lip and a 7 inch barrel. The lip was shortened by 1.5 inches, bringing the offset from -4 to 15.05 ( -4 + 12.7 + 6.35).",
        "contentFourPics": [],
        "contentFive": "",
        "contentFivePics": [],
        "contentSource": "https://www.youtube.com/watch?v=L19eoOX58R4",
        "contentSourceText": "How to measure your Wheel Offset / ET accurately",
        "headerPic": "",
        "tableData": {
            "headers": ["", "+ 1 inch", "+ 0.5 inch", "- 0.5 inch", "- 1 inch"],
            "rows": [
                ["Lip", "- 12.7", "- 6.35", "+ 6.35", "+ 12.7"],
                ["Barrel", "+ 12.7", "+ 6.35", "- 6.35", "- 12.7"]
            ]
        },
        "tableSource": "https://stanceworks.com/forums/forum/style/wheels-tires-brakes/3178-how-to-calculate-offset-after-lip-and-or-barrel-change?t=3145",
        "tableSourceText": "StanceWorks"
    },
    {
        "id": 1,
        "date": "06-16-2024",
        "postTitle": "Welcome to Spare Parts: Special Edition",
        "contentOne": "Once upon a time Spare Parts was a World of Warcraft guild on Ashkandi Horde, built from the remnants of an older guild. I always thought the name sounded better for a car crew. So here we are. I'll be using this site to document my car build, share relevant notes I've taken like calculating offsets / calculating tire stretch / rebuilding or resizing 3 piece wheels etc with sources, and mostly scream into the void. I don't know how often this will be updated, but if anyone even reads this, then I hope it's not terrible :/",
        "contentOneExample": "",
        "contentOnePics": [],
        "contentTwo": "There used to be a car movement in Florida called Simply Clean, which valued keeping cars as stock looking as possible but adding tasteful mods that enhanced the stock look. For example, lowered cars, very slightly stretched tired, and wheels that sit flush with the fenders. That's the same philosophy I strive to bring to my car.",
        "contentTwoPics": [],
        "contentThree": "",
        "contentThreePics": [],
        "contentFour": "",
        "contentFourPics": [],
        "contentFive": "",
        "contentFivePics": [],
        "contentSource": "",
        "contentSourceText": "",
        "headerPic": "",
        "tableData": {},
        "tableSource": "",
        "tableSourceText": ""
    }
]